#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.

x = float(input("Введите первое число: "))
y = float(input("Введите второе число: "))
print ("Сумма =", x + y)
print ("Разность =", x - y)
print ("Частное =", x / y)
print ("Произведение =", x / y)
print ("Результат целочисленного деления =", x // y)
print ("Результат деления с остатком =", x % y)
print ("Результат возведения в степень =", x ** y)