# todo: Определить в коде  переменные:

# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа

# Вывести все их типы.

a = 1
print ("1. переменная 'a':", type(a))

b = 1.3
print ("2. переменная 'b':", type(b))

с = False
print ("3. переменная 'с':", type(с))

d = "Hello, World!"
print ("4. переменная 'd':", type(d))

e = None
print ("5. переменная 'e':", type(e))
